const translation = {
  welcome: {
    firstStepTip: 'Бастау үшін,',
    enterKeyTip: 'төменге өзіңіздің OpenAI API кілтіңізді енгізіңіз',
    getKeyTip: 'OpenAI басқару панелінен API кілтіңізді алыңыз',
    placeholder: 'Сіздің OpenAI API кілтіңіз (мысалы, sk-xxxx)',
  },
  apiKeyInfo: {
    cloud: {
      trial: {
        title: 'Сіз {{providerName}} сынақ квотасын пайдаланудасыз.',
        description:
          'Сынақ квотасы тестілеу үшін берілген. Квота таусылғанға дейін өзіңіздің модель жеткізушіңізді орнатыңыз немесе қосымша квота сатып алыңыз.',
      },
      exhausted: {
        title: 'Сіздің сынақ квотаңыз таусылды, API кілтіңізді баптаңыз.',
        description:
          'Сынақ квотасы тек тестілеу үшін беріледі. Сынақ мерзімі аяқталғанға дейін өзіңіздің модель жеткізушіңізді орнатыңыз немесе қосымша квота сатып алыңыз.',
      },
    },
    selfHost: {
      title: {
        row1: 'Бастау үшін,',
        row2: 'алдымен модель жеткізушісін баптаңыз.',
      },
    },
    callTimes: 'Шақыру саны',
    usedToken: 'Қолданылған токендер',
    setAPIBtn: 'Модель жеткізушісін баптауға өту',
    tryCloud: 'Немесе тегін квотасы бар Shai бұлтты нұсқасын қолданып көріңіз',
  },
  overview: {
    title: 'Шолу',
    appInfo: {
      explanation: 'Дайын қолдануға арналған ЖИ веб-қосымша',
      accessibleAddress: 'Қоғамдық URL',
      preview: 'Алдын ала қарау',
      regenerate: 'Қайта генерациялау',
      regenerateNotice: 'Қоғамдық URL-ді қайта генерациялағыңыз келе ме?',
      preUseReminder: 'Жалғастырмас бұрын веб-қосымшаны іске қосыңыз.',
      settings: {
        entry: 'Баптаулар',
        title: 'Веб-қосымша баптаулары',
        webName: 'Веб-қосымша атауы',
        webDesc: 'Веб-қосымша сипаттамасы',
        webDescTip:'Бұл мәтін қолданба интерфейсінде көрсетіледі және пайдаланушыға қолданба туралы нұсқаулық береді.',
        webDescPlaceholder: 'Веб-қосымша сипаттамасын енгізіңіз',
        language: 'Тіл',
        workflow: {
          title: 'Жұмыс процесі',
          subTitle: 'Жұмыс процесі туралы толық ақпарат',
          show: 'Көрсету',
          hide: 'Жасыру',
          showDesc: 'Жұмыс процесі туралы толық ақпаратты веб-қосымшада көрсету немесе жасыру',
        },
        chatColorTheme: 'Чат түс тақырыбы',
        chatColorThemeDesc: 'Чат-боттың түс тақырыбын орнатыңыз',
        chatColorThemeInverted: 'Түстерді инверсиялау',
        invalidHexMessage: 'Жарамсыз HEX мәні',
        invalidPrivacyPolicy:
          'Жарамсыз құпиялылық саясатының сілтемесі. http немесе https арқылы басталатын жарамды сілтемені пайдаланыңыз',
        sso: {
          label: 'SSO аутентификациясы',
          title: 'Веб-қосымша SSO',
          description:
            'Барлық пайдаланушылар веб-қосымшаны қолданбас бұрын SSO арқылы жүйеге кіруі керек',
          tooltip: 'Веб-қосымша SSO қосуды әкімшіден сұраңыз',
        },
        more: {
          entry: 'Қосымша параметрлерді көрсету',
          copyright: 'Авторлық құқық',
          copyRightPlaceholder: 'Автор немесе ұйымның атауын енгізіңіз',
          privacyPolicy: 'Құпиялылық саясаты',
          privacyPolicyPlaceholder: 'Құпиялылық саясатының сілтемесін енгізіңіз',
          privacyPolicyTip:
            'Қосымша қандай деректерді жинайтынын пайдаланушылар түсіну үшін қолданылады. Толығырақ <privacyPolicyLink>Shai Құпиялылық саясаты</privacyPolicyLink> бөлімінен қараңыз.',
          customDisclaimer: 'Пайдаланушы ескерту мәтіні',
          customDisclaimerPlaceholder: 'Пайдаланушы ескерту мәтінін енгізіңіз',
          customDisclaimerTip:
            'Бұл мәтін клиент жағында көрсетіліп, қосымша туралы қосымша ақпарат береді.',
          copyrightTooltip: 'Professional немесе одан жоғары жоспарға өтіңіз',
          copyrightTip: 'Авторлық құқық ақпараты веб-қосымшада көрсетіледі',
        },
        modalTip: 'Бұл баптаулар веб-қосымша клиент жағында қолданылады.',
      },
      embedded: {
        entry: 'Ендіру',
        title: 'Веб-сайтқа ендіру',
        explanation: 'Чат-қосымшаны веб-сайтыңызға ендіру тәсілін таңдаңыз',
        iframe:
          'Чат-қосымшаны веб-сайтыңыздың кез келген бөлігіне қосу үшін төмендегі iframe кодын HTML-ге енгізіңіз.',
        scripts:
          'Чат-қосымшаны веб-сайттың төменгі оң жақ бұрышына қосу үшін осы кодты HTML-ге енгізіңіз.',
        chromePlugin: 'Chrome үшін Shai Chatbot кеңейтімін орнатыңыз',
        copied: 'Көшірілді',
        copy: 'Көшіру',
      },
      qrcode: {
        title: 'Сілтеме QR-коды',
        scan: 'Сканерлеу арқылы бөлісу',
        download: 'QR-кодты жүктеп алу',
      },
      customize: {
        way: 'тәсіл',
        entry: 'Баптау',
        title: 'AI веб-қосымшасын баптау',
        explanation:
          'Сіз веб-қосымшаның интерфейсін өз қажеттіліктеріңізге қарай баптай аласыз.',
        way1: {
          name: 'Клиент кодын fork жасап, өңдеп, Vercel-де орналастыру (ұсынылады)',
          step1: 'Клиент кодын fork жасап, өзгерту',
          step1Tip:
            'GitHub тіркелгіңізге кодты fork жасап, өңдеу үшін осы жерді басыңыз',
          step1Operation: 'Shai-WebClient',
          step2: 'Vercel-де орналастыру',
          step2Tip:
            'Репозиторийді Vercel-ге импорттап, орналастыру үшін осы жерді басыңыз',
          step2Operation: 'Репозиторийді импорттау',
          step3: 'Орта айнымалыларын баптау',
          step3Tip: 'Vercel ішінде келесі орта айнымалыларды қосыңыз',
        },
        way2: {
          name: 'API шақыратын клиент кодын жазып, өз серверіңізде орналастырыңыз',
          operation: 'Құжаттама',
        },
      },
      launch: 'Іске қосу',
    },
    apiInfo: {
      title: 'API серверлік бөлігі',
      explanation: 'Қосымшаңызға оңай біріктіріледі',
      accessibleAddress: 'API соңғы нүктесі',
      doc: 'API нұсқаулығы',
    },
    status: {
      running: 'Жұмыс істеп тұр',
      disable: 'Өшірілген',
    },
  },
  analysis: {
    title: 'Талдау',
    ms: 'мс',
    tokenPS: 'Токен/с',
    totalMessages: {
      title: 'Барлығы хабарламалар',
      explanation: 'ЖИ-пен күнделікті өзара әрекеттесулер саны.',
    },
    totalConversations: {
      title: 'Барлығы чаттар',
      explanation:
        'LLM-пен күнделікті чат саны; жобалау мен отладка есепке алынбайды.',
    },
    activeUsers: {
      title: 'Белсенді пайдаланушылар',
      explanation:
        'LLM-пен сұрақ-жауапта қатысқан бірегей пайдаланушылар; жобалау/тестілеу есепке алынбайды.',
    },
    tokenUsage: {
      title: 'Токенді қолдану',
      explanation:
        'Қосымшадағы тілдік модельдің күнделікті токен қолдануын көрсетеді және шығындарды бақылауға көмектеседі.',
      consumed: 'Жұмсалды',
    },
    avgSessionInteractions: {
      title: 'Сеанс бойынша орташа әрекеттер саны',
      explanation:
        'Пайдаланушының бір үздіксіз сеанстағы өзара әрекет саны; чатқа негізделген қосымшалар үшін.',
    },
    avgUserInteractions: {
      title: 'Пайдаланушы әрекеттерінің орташа саны',
      explanation:
        'Пайдаланушылардың күнделікті белсенділік жиілігін көрсетеді. Бұл көрсеткіш пайдаланушы белсенділігін көрсетеді.',
    },
    userSatisfactionRate: {
      title: 'Пайдаланушылардың қанағаттану деңгейі',
      explanation:
        '1000 хабарламаға шаққандағы лайк саны. Бұл пайдаланушылар риза болған жауаптардың үлесін көрсетеді.',
    },
    avgResponseTime: {
      title: 'Орташа жауап беру уақыты',
      explanation:
        'LLM өңдеу және жауап беру уақыты (мс); мәтіндік қосымшалар үшін.',
    },
    tps: {
      title: 'Токен шығару жылдамдығы',
      explanation:
        'LLM өнімділігін өлшейді. Сұрау басталғаннан бастап соңғы жауап шыққанға дейінгі токен шығару жылдамдығын есептейді.',
    },
  },
}

export default translation
