const translation = {
  currentPlan: 'Ағымдағы тарифтік жоспар',
  upgradeBtn: {
    plain: 'Тарифтік жоспарды жаңарту',
    encourage: 'Қазір жаңарту',
    encourageShort: 'Жаңарту',
  },
  viewBilling: 'Төлемдер мен жазылымдарды басқару',
  buyPermissionDeniedTip: 'Жазылу үшін ұйымыңыздың әкімшісімен хабарласыңыз',
  plansCommon: {
    title: 'Өзіңізге сай тарифтік жоспарды таңдаңыз',
    yearlyTip: 'Жылдық жазылымға жазылып, 2 айды тегін алыңыз!',
    mostPopular: 'Ең танымал',
    planRange: {
      monthly: 'Ай сайын',
      yearly: 'Жыл сайын',
    },
    month: 'ай',
    year: 'жыл',
    save: 'Жинақтау',
    free: 'Тегін',
    currentPlan: 'Ағымдағы жоспар',
    contractSales: 'Сатылым бөлімімен байланысу',
    contractOwner: 'Топ жетекшісімен байланысу',
    startForFree: 'Тегін бастау',
    contactSales: 'Сатылым бөлімімен байланысу',
    talkToSales: 'Сатылым бөлімімен сөйлесу',
    modelProviders: 'Модель жеткізушілері',
    annotationQuota: 'Аннотация квотасы',
    buildApps: 'Қосымша жасау',
    vectorSpace: 'Векторлық кеңістік',
    vectorSpaceTooltip:
      'Векторлық кеңістік — бұл LLM сіздің деректеріңізді түсіну үшін қажет ұзақ мерзімді жад жүйесі.',
    documentProcessingPriority: 'Құжат өңдеу басымдығы',
    documentProcessingPriorityUpgrade:
      'Көбірек деректерді жоғары дәлдікпен және жылдамдықпен өңдеңіз.',
    priority: {
      standard: 'Стандартты',
      priority: 'Басымдықты',
      'top-priority': 'Жоғары басымдық',
    },
    logsHistory: 'Журнал тарихы',
    customTools: 'Пайдаланушы құралдары',
    unavailable: 'Қолжетімсіз',
    days: 'күн',
    unlimited: 'Шектеусіз',
    support: 'Қолдау қызметі',
    supportItems: {
      communityForums: 'Қауымдастық форумдары',
      emailSupport: 'Электрондық пошта арқылы қолдау',
      priorityEmail: 'Электрондық пошта және чат арқылы басым қолдау',
      logoChange: 'Логотипті өзгерту',
      SSOAuthentication: 'SSO аутентификациясы',
      personalizedSupport: 'Жеке қолдау',
      dedicatedAPISupport: 'API бойынша арнайы қолдау',
      customIntegration: 'Пайдаланушы интеграциясы және қолдау',
      ragAPIRequest: 'RAG API сұраулары',
      bulkUpload: 'Құжаттарды жаппай жүктеу',
      agentMode: 'Агент режимі',
      workflow: 'Жұмыс процесі',
      llmLoadingBalancing: 'LLM жүктемесін теңгеру',
      llmLoadingBalancingTooltip:
        'API жылдамдық шектеулерін айналып өту үшін бірнеше API кілттерін модельдерге қосыңыз.',
    },
    comingSoon: 'Жақында',
    member: 'Қатысушы',
    memberAfter: 'Қатысушы',
    messageRequest: {
      title: 'Аннотация квотасының шектеулері',
      tooltip:
        'OpenAI модельдерін (gpt4-тен басқа) пайдаланатын түрлі жоспарлар үшін хабарлама шақыру квотасы. Шектеуден асқан хабарламалар сіздің OpenAI API кілтіңіз арқылы орындалады.',
      titlePerMonth: '{{count,number}} хабарлама/ай',
    },
    annotatedResponse: {
      title: 'Аннотация квотасының шектеулері',
      tooltip:
        'Қолмен өңдеу және аннотация жасау қосымшаларға жеке жоғары сапалы жауаптар жасауға мүмкіндік береді (тек чат-қосымшаларға қолданылады).',
    },
    ragAPIRequestTooltip:
      'Бұл Shai білім базасын өңдеу функцияларын шақыратын API сұраулар санына қатысты.',
    receiptInfo:
      'Тек топ иесі мен әкімші жазыла алады және шот-фактура ақпаратына қол жеткізе алады',
    cloud: 'Бұлттық сервис',
    annualBilling: 'Жылдық төлем',
    apiRateLimit: 'API жылдамдық шектеуі',
    self: 'Өздігінен орналастырылған',
    teamMember_other: '{{count,number}} топ мүшесі',
    apiRateLimitUnit: '{{count,number}}/күн',
    unlimitedApiRate: 'API сұрауларының санына шектеу жоқ',
    freeTrialTip: '200 OpenAI шақыруынан тұратын тегін сынақ нұсқасы.',
    freeTrialTipSuffix: 'Банк картасы талап етілмейді',
    teamMember_one: '{{count,number}} топ мүшесі',
    getStarted: 'Бастау',
    teamWorkspace: '{{count,number}} топтық жұмыс кеңістігі',
    freeTrialTipPrefix: 'Тіркеліп, алыңыз',
    comparePlanAndFeatures: 'Жоспарлар мен мүмкіндіктерді салыстыру',
    documents: '{{count,number}} Білім құжаты',
    documentsRequestQuota:
      '{{count,number}}/мин білім сұрау лимиті',
    apiRateLimitTooltip:
      'API жылдамдық шектеуі Shai API арқылы жасалған барлық сұрауларға қолданылады, соның ішінде мәтін генерациясы, чат, workflow орындау және құжаттарды өңдеу.',
    documentsRequestQuotaTooltip:
      'Білім базасы ішіндегі әрекеттер санының минуттық шегі. Оған деректер жиынтығын жасау, жою, жаңарту, құжат жүктеу, өзгерту және білім базасына сұрау жібере алу әрекеттері кіреді. Мысалы, Sandbox пайдаланушысы бір минутта 10 сынақ жасаса, келесі минутта білім базасына жаңа әрекеттер жасау уақытша шектеледі.',
    priceTip: 'жұмыс кеңістігіне/',
    documentsTooltip: 'Білім көздерінен импортталатын құжаттар санының квотасы.',
    startBuilding: 'Құрастыруды бастау',
  },
  plans: {
    sandbox: {
      name: 'Sandbox',
      description: 'GPT-ті 200 рет тегін пайдалану',
      for: 'Негізгі мүмкіндіктердің тегін сынағы үшін',
    },
    professional: {
      name: 'Кәсіби',
      description:
        'Жеке пайдаланушылар мен шағын топтар үшін — көбірек мүмкіндіктерді қолжетімді бағамен ашу.',
      for: 'Жеке әзірлеушілер/шағын топтар үшін',
    },
    team: {
      name: 'Топтық',
      description:
        'Шектеусіз ынтымақтасыңыз және ең жоғары өнімділіктен ләззат алыңыз.',
      for: 'Орташа көлемдегі топтар үшін',
    },
    enterprise: {
      name: 'Корпоративтік',
      description:
        'Ірі көлемдегі маңызды жүйелерге арналған толық мүмкіндіктер мен қолдауды алыңыз.',
      includesTitle: 'Топтық жоспарының барлығы, сонымен қатар:',
      features: {
        4: 'SSO',
        5: 'Shai серіктестерінен келісілген SLA',
        2: 'Эксклюзивті корпоративтік функциялар',
        6: 'Кеңейтілген қауіпсіздік және бақылау',
        1: 'Коммерциялық лицензияға рұқсат',
        8: 'Кәсіби техникалық қолдау',
        7: 'Shai тарапынан ресми жаңарту және техникалық қызмет көрсету',
        3: 'Бірнеше жұмыс кеңістігі және кәсіпорынды басқару',
        0: 'Корпоративтік деңгейдегі ауқымды орналастыру шешімдері',
      },
      price: 'Жеке шартпен',
      priceTip: 'Тек жылдық жазылым',
      for: 'Үлкен командалар үшін',
      btnText: 'Сатылым бөлімімен байланысу',
    },
    community: {
      features: {
        1: 'Бір жұмыс кеңістігі',
        2: 'Shai ашық лицензиясына сәйкес келеді',
        0: 'Барлық негізгі мүмкіндіктер ашық репозиторийде қолжетімді',
      },
      name: 'Қауымдастық',
      btnText: 'Қауымдастық нұсқасын бастау',
      price: 'Тегін',
      includesTitle: 'Тегін мүмкіндіктер:',
      description:
        'Жеке пайдаланушыларға, шағын топтарға немесе коммерциялық емес жобаларға арналған',
      for: 'Жеке пайдаланушыларға, шағын топтарға немесе коммерциялық емес жобаларға арналған',
    },
    premium: {
      features: {
        2: 'WebApp логотипі мен брендін баптау',
        1: 'Бір жұмыс кеңістігі',
        3: 'Электрондық пошта және чат арқылы артықшылықты қолдау',
        0: 'Әртүрлі бұлттық провайдерлермен өздігінен сенімді басқару',
      },
      description: 'Орта деңгейдегі ұйымдар мен топтар үшін',
      includesTitle: 'Қауымдастық жоспарының барлығы, саонымен қатар:',
      priceTip: 'Cloud Marketplace негізінде',
      btnText: 'Premium алу',
      comingSoon: 'Microsoft Azure және Google Cloud қолдауы жақында пайда болады',
      price: 'Масштабталатын',
      for: 'Орта деңгейдегі ұйымдар мен топтар үшін',
      name: 'Premium',
    },
  },
  vectorSpace: {
    fullTip: 'Векторлық кеңістік толды.',
    fullSolution: 'Көбірек орын алу үшін тарифтік жоспарыңызды жаңартыңыз.',
  },
  apps: {
    fullTip2des:
      'Орын босату үшін белсенді емес қосымшаларды жою ұсынылады немесе бізбен хабарласыңыз.',
    fullTip2: 'Жоспар шегіне жетті',
    contactUs: 'Бізбен байланысу',
    fullTip1des: 'Бұл жоспар бойынша қосымша жасау шегіне жеттіңіз',
    fullTip1: 'Көбірек қосымшалар жасау үшін жаңартыңыз',
  },
  annotatedResponse: {
    fullTipLine1: 'Тарифтік жоспарыңызды жаңартыңыз,',
    fullTipLine2: 'тағы да көп сөйлесулерді аннотациялау үшін.',
    quotaTitle: 'Аннотация жауаптарының квотасы',
  },
  usagePage: {
    buildApps: 'Қосымшалар жасау',
    teamMembers: 'Топ мүшелері',
    vectorSpaceTooltip:
      'Жоғары сапалы индексация режимі бар құжаттар Білім қоймасының ресурстарын пайдаланады. Шектеуге жеткенде жаңа құжаттар жүктелмейді.',
    annotationQuota: 'Аннотация квотасы',
    vectorSpace: 'Білім қоймасы',
    documentsUploadQuota: 'Құжат жүктеу квотасы',
  },
  teamMembers: 'Топ мүшелері',
}

export default translation
