const translation = {
  creation: {
    createFromScratch: {
      title: 'Бос білім конвейері',
      description: 'Деректерді өңдеу мен құрылымды толық бақылаумен нөлден бастап өзіңіздің конвейеріңізді жасаңыз.',
    },
    importDSL: 'DSL файлын импорттау',
    caution: 'Сақ болыңыз',
    backToKnowledge: 'Білім базасына оралу',
    createKnowledge: 'Білім базасын жасау',
    successTip: 'Білім базасы сәтті құрылды',
    errorTip: 'Білім базасын жасау сәтсіз аяқталды',
  },
  templates: {
    customized: 'Баптау',
  },
  operations: {
    choose: 'Таңдау',
    process: 'Өңдеу',
    details: 'Толығырақ',
    dataSource: 'Дерек көзі',
    preview: 'Алдын ала қарау',
    saveAndProcess: 'Сақтау және өңдеу',
    backToDataSource: 'Дерек көзіне оралу',
    editInfo: 'Ақпаратты өңдеу',
    useTemplate: 'Осы білім конвейерін пайдалану',
    convert: 'Түрлендіру',
    exportPipeline: 'Конвейерді экспорттау',
  },
  deletePipeline: {
    title: 'Бұл конвейер үлгісін жойғыңыз келетініне сенімдісіз бе?',
    content: 'Конвейер үлгісін жою қайтарылмайды.',
  },
  publishPipeline: {
    success: {
      message: 'Білім конвейері жарияланды',
    },
    error: {
      message: 'Білім конвейерін жариялау сәтсіз аяқталды',
    },
  },
  publishTemplate: {
    success: {
      learnMore: 'Толығырақ білу',
      message: 'Конвейер үлгісі жарияланды',
      tip: 'Бұл үлгіні жасау бетінде пайдалануға болады.',
    },
    error: {
      message: 'Конвейер үлгісін жариялау сәтсіз аяқталды',
    },
  },
  exportDSL: {
    successTip: 'DSL конвейері сәтті экспортталды',
    errorTip: 'DSL конвейерін экспорттау сәтсіз аяқталды',
  },
  details: {
    structure: 'Құрылым',
    structureTooltip:
      'Блок құрылымы құжаттарды бөлу мен индекстеу тәртібін анықтайды («Жалпы», «Ата-бала» және «Сұрақ-жауап» режимдеріне сәйкес) және әр білім базасы үшін бірегей болып табылады.',
  },
  testRun: {
    steps: {
      dataSource: 'Дерек көзі',
      documentProcessing: 'Құжаттарды өңдеу',
    },
    dataSource: {
      localFiles: 'Жергілікті файлдар',
    },
    notion: {
      docTitle: 'Notion құжаттамасы',
      title: 'Notion беттерін таңдау',
    },
    title: 'Тесттік орындау',
    tooltip:
      'Тест режимінде қарапайым қателерді бақылау үшін тек бір құжатты импорттауға рұқсат етіледі.',
  },
  inputFieldPanel: {
    uniqueInputs: {
      title: 'Әр дерек көзіне арналған бірегей енгізулер',
      tooltip:
        'Бірегей енгізу өрістері тек таңдалған дерек көзі мен оған байланысты түйіндерге қолжетімді. Басқа дерек көздерін таңдағанда пайдаланушы оларды толтырудың қажеті жоқ. Бірінші қадамда (Data Source) тек дерек көзі айнымалыларына сілтеме жасайтын өрістер көрсетіледі. Қалған өрістер екінші қадамда (Process Documents) көрсетіледі.',
    },
    globalInputs: {
      title: 'Барлық енгізулерге ортақ өрістер',
      tooltip:
        'Жалпы енгізу өрістері барлық түйіндерге ортақ. Мысалы, бөлгіш немесе блоктың максималды ұзындығы сияқты параметрлер бірнеше дерек көзіне бірдей қолданылуы мүмкін. Бірінші қадамда дерек көзіне қатысты айнымалылар ғана көрсетіледі, ал қалғандары екінші қадамда (Process Documents) шығады.',
    },
    preview: {
      stepOneTitle: 'Дерек көзі',
      stepTwoTitle: 'Құжаттарды өңдеу',
    },
    error: {
      variableDuplicate: 'Айнымалының аты қайталанады. Басқа атау таңдаңыз.',
    },
    addInputField: 'Енгізу өрісін қосу',
    editInputField: 'Енгізу өрісін өңдеу',
    title: 'Пайдаланушы енгізу өрістері',
    description:
      'Пайдаланушы енгізу өрістері конвейер орындау процесінде қажет айнымалыларды анықтау және жинау үшін қолданылады. Пайдаланушылар өріс түрін және енгізу мәнін өз қажеттілігіне сай икемдей алады.',
  },
  addDocuments: {
    steps: {
      processDocuments: 'Құжаттарды өңдеу',
      chooseDatasource: 'Дерек көзін таңдау',
      processingDocuments: 'Құжаттарды өңдеу процесі',
    },
    stepOne: {
      preview: 'Алдын ала қарау',
    },
    stepTwo: {
      chunkSettings: 'Фрагмент баптаулары',
      previewChunks: 'Фрагменттерді алдын ала қарау',
    },
    stepThree: {
      learnMore: 'Толығырақ білу',
    },
    characters: 'таңбалар',
    backToDataSource: 'Дерек көзіне оралу',
    title: 'Құжаттарды қосу',
  },
  documentSettings: {
    title: 'Құжат баптаулары',
  },
  onlineDocument: {},
  onlineDrive: {
    breadcrumbs: {
      allFiles: 'Барлық файлдар',
      searchPlaceholder: 'Файлдарды іздеу...',
      allBuckets: 'Барлық бұлттық сақтау шелектері',
    },
    resetKeywords: 'Кілт сөздерді тазалау',
    emptyFolder: 'Бұл қалта бос',
    emptySearchResult: 'Элементтер табылмады',
    notSupportedFileType: 'Бұл файл түрі қолдау көрсетілмейді',
  },
  credentialSelector: {},
  conversion: {
    confirm: {
      title: 'Растау',
      content:
        'Бұл әрекет қайтарылмайды. Алдыңғы әдіске қайта оралу мүмкін емес. Түрлендіруді растаңыз.',
    },
    title: 'Білім конвейеріне түрлендіру',
    warning: 'Бұл әрекетті болдырмау мүмкін емес.',
    errorMessage: 'Деректер жиынын конвейерге түрлендіру сәтсіз аяқталды',
    successMessage: 'Деректер жиыны сәтті конвейерге түрлендірілді',
    descriptionChunk2:
      '— бұл плагиндер маркетплейсіне қолжетімді, ашық әрі икемді тәсіл. Бұл әдіс барлық болашақ құжаттарға жаңа өңдеу тәсілін қолдануға мүмкіндік береді.',
    descriptionChunk1:
      'Енді бар білім базасын құжаттарды өңдеу үшін білім конвейерін қолдануға түрлендіре аласыз',
  },
  knowledgeDescription: 'Білім сипаттамасы',
  inputField: 'Енгізу өрісі',
  knowledgePermissions: 'Рұқсаттар',
  pipelineNameAndIcon: 'Конвейер атауы мен белгішесі',
  knowledgeNameAndIcon: 'Білім базасының атауы мен белгішесі',
  knowledgeNameAndIconPlaceholder: 'Білім базасының атауын енгізіңіз',
  editPipelineInfo: 'Конвейер туралы ақпаратты өңдеу',
  knowledgeDescriptionPlaceholder:
    'Бұл білім базасына не кіретінін сипаттаңыз. Толық сипаттама ЖИ жүйесіне деректер мазмұнына дәлірек қол жеткізуге мүмкіндік береді. Егер бос қалса, Dify әдепкі іздеу стратегиясын қолданады. (Қосымша)',
}

export default translation
