const translation = {
  modalTitle: 'Маңызды',
  heading: 'Жеке деректерді қорғау',
  descLine1:
    'shai.pro қызметін пайдалана отырып, жеке деректерді өңдеу және қорғау талаптарымен келісесіз',
  descLine2: 'Қазақстан Республикасының заңнамасына сәйкес',
  linkText: 'Құпиялық саясатымен танысу',
  exit: 'Шығу',
  agree: 'Келісемін',
  policyModalTitle: 'Құпиялылық және жеке деректерді өңдеу саясаты',
  policyModalClose: 'Закрыть',
  policyContent: [
    {
      type: 'text',
      text: 'Осы Құпиялылық және жеке деректерді өңдеу саясаты (бұдан әрі – Саясат) shai.pro ақпараттық жүйесінің (бұдан әрі – «Жүйе») пайдаланушылары туралы ақпаратты өңдеу және қорғау тәртібін, мақсаттары мен принциптерін анықтайды, «Жеке деректерді қорғау туралы» Қазақстан Республикасы Заңының талаптарына сәйкес әзірленген және ISO/IEC 27001 халықаралық стандартының қағидаттарына негізделеді.',
    },
    { type: 'subtitle', text: '1. ТЕРМИНДЕР МЕН АНЫҚТАМАЛАР' },
    {
      type: 'text',
      text: '1.1. Жүйе әкімшілігі (бұдан әрі – «Оператор» немесе «Біз») – Жеке деректерді өңдеуді ұйымдастыратын және (немесе) жүзеге асыратын, сондай-ақ олардың өңдеу мақсаттары мен мазмұнын айқындайтын Жүйе иесінің уәкілетті қызметкерлері.',
    },
    {
      type: 'text',
      text: '1.2. Ақпараттық қауіпсіздікті басқару жүйесі (АХБЖ) – ISO/IEC 27001 қағидаттарына сәйкес ақпараттық қауіпсіздікті құруға, енгізуге, пайдалануға, бақылауға, талдауға, қолдауға және жақсартуға бағытталған бизнес тәуекелдерін бағалауға негізделген жалпы басқару жүйесінің бөлігі.',
    },
    {
      type: 'text',
      text: '1.3. Жеке деректер –  тікелей немесе жанама түрде жеке тұлғаға (жеке деректер субъектісіне) қатысты кез келген ақпарат.',
    },
    {
      type: 'text',
      text: '1.4. Жеке деректерді өңдеу – жеке деректермен жасалатын кез келген әрекет (операция) немесе олардың жиынтығы: жинау, жазу, жүйелеу, жинақтау, сақтау, нақтылау (жаңарту, өзгерту), алу, пайдалану, беру (тарату, ұсыну, қол жеткізу), иесіздендіру, бұғаттау, жою, жоюға жіберу.',
    },
    {
      type: 'text',
      text: '1.5. Жеке деректердің құпиялылығы – жеке деректер субъектісінің келісімінсіз немесе заңды негіз болмаған жағдайда олардың таралуына жол бермеу жөніндегі міндетті талап.',
    },
    {
      type: 'text',
      text: '1.6. Пайдаланушы (Жеке деректер субъектісі) – Жүйеге Интернет арқылы қол жеткізе алатын және Жүйені пайдаланатын тұлға.',
    },
    { type: 'text', text: '1.7. Cookies – жүйеге әр кірген сайын веб-серверге жіберілетін, Пайдаланушы құрылғысында сақталатын шағын деректер фрагменті.' },
    { type: 'text', text: '1.8. IP мекенжайы – IP протоколы арқылы құрастырылған компьютерлік желідегі түйіннің бірегей желілік мекенжайы.' },
    { type: 'subtitle', text: '2. ЖАЛПЫ ЕРЕЖЕЛЕР. ӨҢДЕУ ПРИНЦИПТЕРІ' },
    {
      type: 'text',
      text: '2.1. Пайдаланушының Жүйені пайдалануы оның осы Саясатқа және оның жеке деректерін өңдеу шарттарына сөзсіз келісімін білдіреді.',
    },
    {
      type: 'text',
      text: '2.2. Саясат шарттарымен келіспеген жағдайда Пайдаланушы Жүйені пайдалануды дереу тоқтатуы керек.',
    },
    {
      type: 'text',
      text: 'Оператор жеке деректерді келесі принциптер негізінде өңдейді:\n - Заңдылық, әділдік және ашықтық.\n - Өңдеудің алдын ала айқындалған және заңды мақсаттармен шектелуі.\n -	Деректерді минимизациялау (тек көрсетілген мақсаттарға қажетті деректерді жинау).\n -	Мәліметтердің дәлдігі мен өзектілігі.\n -	Өңдеу мақсаттары үшін талап етілетіннен артық емес нысанды сәйкестендіруге мүмкіндік беретін пішіндерде сақтау шектеулері.\n -	Жеке деректерге рұқсатсыз және заңсыз қол жеткізуден, сонымен қатар олардың жоғалуынан, жойылуынан немесе бұзылуынан тиісті деңгейде қорғауды қамтамасыз ету.',
    },
    {
      type: 'text',
      text: '2.4. Бұл Саясат тек shai.pro ақпараттық жүйесіне қолданылады. Жүйе Пайдаланушы shai.pro сайтында қол жетімді сілтемелер арқылы қол жеткізе алатын үшінші тұлға веб-сайттарын бақыламайды және оларға жауапты емес.',
    },
    { type: 'subtitle', text: '3. САЯСАТ ПӘНІ. ДЕРЕКТЕРДІҢ ҚҰРАМЫ' },
    {
      type: 'text',
      text: '3.1. Осы Саясат Оператордың құпиялылықты сақтау және Жүйені пайдалану кезінде Пайдаланушы беретін жеке деректердің қорғалуын және құпиялылығын қамтамасыз ету бойынша міндеттемелерін айқындайды.',
    },
    {
      type: 'text',
      text: '3.2. Өңдеуге рұқсат етілген жеке деректер Пайдаланушының Сайттағы формаларды толтыруы арқылы ұсынылады және қамтуы мүмкін:\n* Тегі, аты, әкесінің аты;\n* Байланыс телефоны;\n* Электрондық поштаның адресі;\n* Өңдеу мақсаттарына жету үшін қажетті басқа ақпарат.',
    },
    {
      type: 'text',
      text: '3.3. Техникалық ақпарат (келу тарихы, cookies, IP-мекенжайлар, браузер түрлері, операциялық жүйе деректері) иесіздендірілген түрде жиналады және талдау, Жүйенің жұмысын жақсарту, қауіпсіздігін қамтамасыз ету, кибершабуылдарға қарсы әрекет ету мақсатында өңделеді.',
    },
    { type: 'subtitle', text: '4. ЖЕКЕ ДЕРЕКТЕРДІ ӨҢДЕУДІҢ МАҚСАТТАРЫ' },
    { type: 'text', text: 'Оператор Пайдаланушының жеке деректерін келесі мақсаттарда өңдейді:' },
    { type: 'text', text: '4.1. Жүйе қызметтерін пайдалану шеңберінде Пайдаланушыны сәйкестендіру.' },
    { type: 'text', text: '4.2. Пайдаланушыға жекелендірілген ресурстарға және Жүйе функционалына қол жеткізу беру.' },
    { type: 'text', text: '4.3. Пайдаланушымен кері байланыс орнату, соның ішінде сұраулар мен өтінімдерін өңдеу.' },
    { type: 'text', text: '4.4. Ұсынылған Жеке деректердің дұрыстығын мен толықтығын растау.' },
    { type: 'text', text: '4.5. Клиенттік және техникалық қолдауды қамтамасыз ету.' },
    {
      type: 'text',
      text: '4.6. Пайдаланушының келісімі бойынша жаңартулар, арнайы ұсыныстар, жаңалықтар және өзге ақпарат жөнінде хабардар ету.',
    },
    { type: 'text', text: '4.7. Пайдаланушы алдындағы шарттық және шартқа дейінгі міндеттемелерді орындау.' },
    { type: 'text', text: '4.8. Қазақстан Республикасының қолданыстағы заңнамасының талаптарын орындау.' },
    { type: 'subtitle', text: '5. ЗАҢДЫҚ НЕГІЗДЕР ЖӘНЕ ӨҢДЕУ ШАРТТАРЫ' },
    {
      type: 'text',
      text: '5.1. Жеке деректер Пайдаланушының осы Саясаттың 2.1-тармағына сәйкес берген келісімі негізінде, сондай-ақ Пайдаланушы тарап болып табылатын шарттарды орындау үшін өңделеді.',
    },
    {
      type: 'text',
      text: '5.2. Жеке деректерді өңдеу мерзімі олар жинақталған мақсаттарға қол жеткізумен айқындалады, егер өзге мерзім шартпен немесе ҚР заңнамасымен көзделмесе.',
    },
    {
      type: 'text',
      text: '5.3. Өңдеу мерзімі аяқталғаннан кейін Жеке деректер ISO/IEC 27001 талаптарына және Қазақстан Республикасының заңнамасына сәйкес келетін Оператордың ішкі рәсімдерінде белгіленген тәртіппен жойылуға немесе иесізденуге жатады.',
    },
    { type: 'subtitle', text: '6. ЖЕКЕ ДЕРЕКТЕРДІ ҮШІНШІ ТҰЛҒАЛАРҒА БЕРУ' },
    {
      type: 'text',
      text: '6.1. Оператор келесі жағдайларда жеке деректерді үшінші тұлғаларға беруге құқылы:\n- Субъект мұндай әрекеттерге келісімін білдірді.\n - Пайдаланушыға қызмет көрсету немесе шарттық міндеттемелерді орындау үшін беру қажетті болғанда (мысалы, курьерлік қызметтерге, байланыс операторларына).\n- Аударым қызмет көрсету немесе Пайдаланушы алдындағы міндеттемелерді орындау үшін қажет (мысалы, курьерлік қызметтер, байланыс қызметтерін жеткізушілер).\n- Қазақстан Республикасының заңнамасында белгіленген тәртіппен уәкілетті мемлекеттік органдар талап еткен жағдайда.',
    },
    {
      type: 'text',
      text: '6.2. Оператор жеке деректерді үшінші тұлғаларға берген кезде олардың қауіпсіздігін қамтамасыз ету үшін барлық қажетті шарттық және ұйымдастырушылық шараларды қабылдайды.',
    },
    { type: 'subtitle', text: '7. ҚОРҒАУ ШАРАЛАРЫ ЖӘНЕ ISO/IEC 27001 СӘЙКЕСТІГІ' },
    {
      type: 'text',
      text: '7.1. Оператор Пайдаланушының жеке деректерін рұқсатсыз немесе кездейсоқ қол жеткізуден, жоюдан, өзгертуден, бұғаттаудан, көшіруден, таратудан және басқа да заңсыз әрекеттерден қорғау үшін қажетті және жеткілікті ұйымдастырушылық және техникалық шараларды қабылдайды.',
    },
    {
      type: 'text',
      text: '7.2. Қорғаныс шаралары мыналарды қамтиды, бірақ олармен шектелмейді:\n- Қол жеткізуді басқару: жеке деректерге қол жеткізу құқықтарын шектеу саясатын жүзеге асыру.\n- Шифрлау: Байланыс арналары бойынша тасымалдау және қажет болған жағдайда сақтау кезінде криптографиялық деректерді қорғау құралдарын пайдалану.\n- Тұрақты мониторинг және тәуекелдерді талдау: АҚБЖ жұмыс істеуі шеңберінде.\n- Оқиғаларды басқару: жеке деректерге қатысты ақпараттық қауіпсіздік оқиғаларына жауап беру рәсімдерінің болуы.\n- Оқыту және ақпарат: жеке деректерге қол жеткізе алатын қызметкерлерге тұрақты нұсқаулықтар өткізу.\n- Сәйкестікті бағалау: ішкі аудиттер және қауіпсіздік шараларын мерзімдік қайта қарау.',
    },
    { type: 'subtitle', text: '8. ЖЕКЕ ДЕРЕКТЕР СУБЪЕКТІНІҢ ҚҰҚЫҚТАРЫ' },
    { type: 'text', text: 'Қазақстан Республикасының заңнамасына сәйкес Пайдаланушы құқылы:' },
    { type: 'text', text: '8.1. Өзінің жеке деректерінің өңделуіне қатысты ақпарат алуға.' },
    { type: 'text', text: '8.2. Жеке деректеріне қол жеткізуге, оларды нақтылауға немесе түзетуге.' },
    {
      type: 'text',
      text: '8.3. Жеке деректерді өңдеуге берілген келісімді кері қайтарып алуға. Келісімді қайтарып алу Сайттың кейбір сервистерін пайдалану мүмкін еместігіне әкеп соғуы мүмкін.',
    },
    {
      type: 'text',
      text: '8.4. Деректер толық емес, ескірген, дұрыс емес, заңсыз алынған немесе өңдеудің белгіленген мақсаты үшін қажет болмаса, сіздің жеке деректеріңізді жою және/немесе өңдеуді тоқтату.',
    },
    {
      type: 'text',
      text: 'Өз құқықтарын жүзеге асыру үшін Пайдаланушы Операторға info@shai.pro электрондық поштасына сәйкес сұрау жібере алады .',
    },
    { type: 'subtitle', text: '9. ТАРАПТАРДЫҢ МІНДЕТТЕРІ МЕН ЖАУАПКЕРШІЛІГІ' },
    { type: 'text', text: '9.1. Пайдаланушы міндетті: нақты деректерді ұсынуға және оларды уақтылы жаңартуға.' },
    {
      type: 'text',
      text: '9.2. Оператор міндеттенеді:\n- Деректерді Саясаттың 4-бөлімінде көрсетілген мақсаттар үшін ғана пайдалануға.\n- Заңда көзделген жағдайларды қоспағанда, деректердің құпиялылығын қамтамасыз ету және оны Пайдаланушының келісімінсіз үшінші тұлғаларға бермеуге.\n- Саясат пен заңнамада көзделген деректерді қорғау үшін барлық шараларды қабылдауға.',
    },
    {
      type: 'text',
      text: '9.3. Оператор Пайдаланушының жеке деректерін заңсыз пайдаланудан келтірілген залал үшін ҚР заңнамасына сәйкес жауапкершілік көтереді.',
    },
    {
      type: 'text',
      text: '9.4. Оператор деректердің өз кінәсінен жалпыға белгілі болса, үшінші тұлғадан алынса немесе Пайдаланушының келісімімен жария етілсе, оның жоғалуы немесе ашылуы үшін жауап бермейді.',
    },
    { type: 'subtitle', text: '10. ДАУЛАРДЫ ШЕШУ ТӘРТІБІ' },
    { type: 'text', text: '10.1. Сотқа жүгінгенге дейін міндетті түрде жазбаша шағым ұсынылуға тиіс.' },
    {
      type: 'text',
      text: '10.2. Шағымды алған тұлға оны алған күннен бастап 30 (отыз) күнтізбелік күн ішінде қарау нәтижелері туралы жазбаша жауап береді.',
    },
    {
      type: 'text',
      text: '10.3. Келісімге қол жеткізілмеген жағдайда дау Қазақстан Республикасының заңнамасына сәйкес сот тәртібімен шешіледі.',
    },
    { type: 'subtitle', text: '11. ҚОРЫТЫНДЫ ЕРЕЖЕЛЕР' },
    {
      type: 'text',
      text: '11.1. Оператор осы Саясатқа біржақты тәртіппен өзгерістер енгізуге құқылы. Жаңа нұсқа Жүйеде жарияланғаннан бастап күшіне енеді, егер жаңа нұсқада өзгертулер көзделмесе.',
    },
    {
      type: 'text',
      text: '11.2. Саясатқа қатысты барлық ұсыныстар немесе сұрақтар info@shai.pro мекенжайына жіберілуі тиіс.',
    },
    // {
    //   type: 'text',
    //   text: '11.3. Саясаттың өзекті нұсқасы келесі бетте орналастырылған: https://shai.pro/privacy-policy.',
    // },
  ],
}

export default translation

