const translation = {
  common: {
    publishAsPipeline: {
      description: 'Білім сипаттамасы',
      name: 'Конвейердің атауы мен белгішесі',
      namePlaceholder:
        'Осы білім конвейерінің атауын енгізіңіз. (Міндетті)',
      descriptionPlaceholder:
        'Осы білім конвейерінің сипаттамасын енгізіңіз. (Қосымша)',
    },
    processing: 'Өңделуде',
    reRun: 'Қайта іске қосу',
    testRun: 'Тесттік іске қосу',
    preparingDataSource: 'Дереккөзді дайындау',
    confirmPublish: 'Жариялауды растау',
    goToAddDocuments: 'Құжаттар қосуға өту',
    publishAs: 'Білім конвейері ретінде жариялау',
    confirmPublishContent:
      'Білім конвейері сәтті жарияланғаннан кейін, осы білім базасының блок құрылымын өзгерту мүмкін болмайды. Сіз оны шынымен жариялағыңыз келе ме?',
  },
  inputField: {
    manage: 'Басқару',
    create: 'Пайдаланушы енгізу өрісін жасау',
  },
  publishToast: {
    title: 'Бұл конвейер әлі жарияланбаған',
    desc: 'Егер конвейер жарияланбаса, сіз білім базасының түйініндегі блок құрылымын өзгерте аласыз. Барлық оркестрация және өзгерістер автоматты түрде қаралым (черновик) ретінде сақталады.',
  },
  result: {
    resultPreview: {
      viewDetails: 'Толығырақ',
      loading: 'Өңделуде... Күтіңіз',
      error: 'Орындау кезінде қате орын алды',
    },
  },
  ragToolSuggestions: {
    title: 'RAG бойынша ұсыныстар',
  },
}

export default translation
